#
fruits = ["яблоко", "банан", "груша"]
numbers = [1, 2, 3, 4, 5]
empty = []

#   Индексация
fruits2 = ["яблоко", "банан", "груша", "апельсин"]
# индексы:    0         1        2         3
# с конца:   -4        -3       -2        -1

print(fruits2[0])   # яблоко
print(fruits2[2])   # груша
print(fruits2[-1])  # апельсин (последний!)
print(fruits2[-2])  # груша (предпоследний)

#   Срезы
nums = [10, 20, 30, 40, 50, 60, 70]
#        0   1   2   3   4   5   6

print(nums[1:4])   # [20, 30, 40]
print(nums[:3])    # [10, 20, 30]
print(nums[3:])    # [40, 50, 60, 70]
print(nums[:])     # копия всего списка
print(nums[-3:])   # [50, 60, 70]
print(nums[:-3])   # [10, 20, 30, 40]

print(nums[::2])    # [10, 30, 50, 70] — каждый второй
print(nums[::-1])   # [70, 60, 50, 40, 30, 20, 10] — развёрнутый