#   Добавление
a = [1, 2, 3]
a.append(4)        # [1, 2, 3, 4] — добавить в конец
a.insert(1, 99)    # [1, 99, 2, 3, 4] — вставить по индексу

#   Удаление
a = [10, 20, 30, 20, 40]
a.remove(20)   # удаляет ПЕРВОЕ вхождение → [10, 30, 20, 40]
last = a.pop() # удаляет последний, возвращает его → last=40, a=[10, 30, 20]
x = a.pop(0)   # удаляет по индексу → x=10, a=[30, 20]

#   Замена
a = ["a", "b", "c"]
a[1] = "B"           # ['a', 'B', 'c']
a[0:2] = ["X", "Y"]  # ['X', 'Y', 'c'] — замена срезом

#   Проверка
a = [1, 2, 3]
print(2 in a)     # True
print(5 in a)     # False

#   Изменение
a = [1, 2, 3]
b = a          # b — это НЕ копия, это ВТОРАЯ ССЫЛКА на тот же список!
b.append(4)
print(a)       # [1, 2, 3, 4] — а тоже изменился!